yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_bus.c
/**
 ******************************************************************************
 * @file    stm32h7rsxx_nucleo_bus.c
 * @author  MCD Application Team
 * @brief   This file provides a set of firmware functions to communicate
 *          with  external devices available on STM32H7RS NUCLEO-144 board (MB1737) from
 *          STMicroelectronics
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_mybrd_bus.h"

/** @addtogroup BSP
 * @{
 */

/** @addtogroup STM32H7RSXX_NUCLEO
 * @{
 */

/** @defgroup STM32H7RSXX_NUCLEO_BUS BUS
 * @{
 */

/** @defgroup STM32H7RSXX_NUCLEO_BUS_Private_Constants Private Constants
 * @{
 */
#ifndef I2C_VALID_TIMING_NBR
    #define I2C_VALID_TIMING_NBR 128U
#endif                                   /* I2C_VALID_TIMING_NBR */
#define I2C_SPEED_FREQ_STANDARD     0U   /* 100 kHz */
#define I2C_SPEED_FREQ_FAST         1U   /* 400 kHz */
#define I2C_SPEED_FREQ_FAST_PLUS    2U   /* 1 MHz */
#define I2C_ANALOG_FILTER_DELAY_MIN 50U  /* ns */
#define I2C_ANALOG_FILTER_DELAY_MAX 260U /* ns */
#define I2C_USE_ANALOG_FILTER       1U
#define I2C_DIGITAL_FILTER_COEF     0U
#define I2C_PRESC_MAX               16U
#define I2C_SCLDEL_MAX              16U
#define I2C_SDADEL_MAX              16U
#define I2C_SCLH_MAX                256U
#define I2C_SCLL_MAX                256U
#define SEC2NSEC                    1000000000UL
/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_BUS_Private_Types Private Types
 * @{
 */
typedef struct
{
    uint32_t freq;      /* Frequency in Hz */
    uint32_t freq_min;  /* Minimum frequency in Hz */
    uint32_t freq_max;  /* Maximum frequency in Hz */
    uint32_t hddat_min; /* Minimum data hold time in ns */
    uint32_t vddat_max; /* Maximum data valid time in ns */
    uint32_t sudat_min; /* Minimum data setup time in ns */
    uint32_t lscl_min;  /* Minimum low period of the SCL clock in ns */
    uint32_t hscl_min;  /* Minimum high period of SCL clock in ns */
    uint32_t trise;     /* Rise time in ns */
    uint32_t tfall;     /* Fall time in ns */
    uint32_t dnf;       /* Digital noise filter coefficient */
} I2C_Charac_t;

typedef struct
{
    uint32_t presc;   /* Timing prescaler */
    uint32_t tscldel; /* SCL delay */
    uint32_t tsdadel; /* SDA delay */
    uint32_t sclh;    /* SCL high period */
    uint32_t scll;    /* SCL low period */
} I2C_Timings_t;
/**
 * @}
 */

/** @addtogroup STM32H7RSXX_NUCLEO_BUS_Private_Constants
 * @{
 */
static const I2C_Charac_t I2C_Charac[] =
    {
        [I2C_SPEED_FREQ_STANDARD] =
            {
                                       .freq      = 100000,
                                       .freq_min  = 80000,
                                       .freq_max  = 120000,
                                       .hddat_min = 0,
                                       .vddat_max = 3450,
                                       .sudat_min = 250,
                                       .lscl_min  = 4700,
                                       .hscl_min  = 4000,
                                       .trise     = 640,
                                       .tfall     = 20,
                                       .dnf       = I2C_DIGITAL_FILTER_COEF,
                                       },
        [I2C_SPEED_FREQ_FAST] =
            {
                                       .freq      = 400000,
                                       .freq_min  = 320000,
                                       .freq_max  = 480000,
                                       .hddat_min = 0,
                                       .vddat_max = 900,
                                       .sudat_min = 100,
                                       .lscl_min  = 1300,
                                       .hscl_min  = 600,
                                       .trise     = 250,
                                       .tfall     = 100,
                                       .dnf       = I2C_DIGITAL_FILTER_COEF,
                                       },
        [I2C_SPEED_FREQ_FAST_PLUS] =
            {
                                       .freq      = 1000000,
                                       .freq_min  = 800000,
                                       .freq_max  = 1200000,
                                       .hddat_min = 0,
                                       .vddat_max = 450,
                                       .sudat_min = 50,
                                       .lscl_min  = 500,
                                       .hscl_min  = 260,
                                       .trise     = 60,
                                       .tfall     = 100,
                                       .dnf       = I2C_DIGITAL_FILTER_COEF,
                                       },
};
/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_BUS_Private_Variables Private Variables
 * @{
 */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
static uint32_t IsI2c1MspCbValid = 0;
#endif /* (USE_HAL_I2C_REGISTER_CALLBACKS == 1) */
static uint32_t I2c1InitCounter = 0;
static I2C_Timings_t I2c_valid_timing[I2C_VALID_TIMING_NBR];
static uint32_t I2c_valid_timing_nbr = 0;
#if defined(BSP_USE_CMSIS_OS)
static osSemaphoreId BspI2cSemaphore = 0;
#endif /* BSP_USE_CMSIS_OS */
/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_BUS_Exported_Variables Exported Variables
 * @{
 */
I2C_HandleTypeDef hbus_i2c3;
/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_BUS_Private_FunctionPrototypes BUS Private FunctionPrototypes
 * @{
 */
static void I2C3_MspInit(I2C_HandleTypeDef* phi2c);
static void I2C3_MspDeInit(I2C_HandleTypeDef* phi2c);
static int32_t I2C3_WriteReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t* pData, uint16_t Length);
static int32_t I2C3_ReadReg(uint16_t DevAddr, uint16_t MemAddSize, uint16_t Reg, uint8_t* pData, uint16_t Length);
static uint32_t I2C_GetTiming(uint32_t clock_src_freq, uint32_t i2c_freq);
static uint32_t I2C_Compute_SCLL_SCLH(uint32_t clock_src_freq, uint32_t I2C_speed);
static void I2C_Compute_PRESC_SCLDEL_SDADEL(uint32_t clock_src_freq, uint32_t I2C_speed);
/**
 * @}
 */

