yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_bus.c
/** @defgroup STM32H7RSXX_NUCLEO_BUS_Exported_Functions Exported Functions
 * @{
 */

/**
 * @brief  Initializes I2C HAL.
 * @retval BSP status
 */
int32_t BSP_I2C3_Init(void)
{
    int32_t ret = BSP_ERROR_NONE;

    hbus_i2c3.Instance = BUS_I2C3;

    if (I2c1InitCounter == 0U)
    {
        I2c1InitCounter++;

        if (HAL_I2C_GetState(&hbus_i2c3) == HAL_I2C_STATE_RESET)
        {
#if defined(BSP_USE_CMSIS_OS)
            if (BspI2cSemaphore == NULL)
            {
                /* Create semaphore to prevent multiple I2C access */
                osSemaphoreDef(BSP_I2C_SEM);
                BspI2cSemaphore = osSemaphoreCreate(osSemaphore(BSP_I2C_SEM), 1);
            }
#endif /* BSP_USE_CMSIS_OS */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 0)
            /* Init the I2C3 Msp */
            I2C3_MspInit(&hbus_i2c3);
#else
            if (IsI2c1MspCbValid == 0U)
            {
                if (BSP_I2C3_RegisterDefaultMspCallbacks() != BSP_ERROR_NONE)
                {
                    ret = BSP_ERROR_MSP_FAILURE;
                }
            }
            if (ret == BSP_ERROR_NONE)
            {
#endif /* (USE_HAL_I2C_REGISTER_CALLBACKS == 0) */
            if (MX_I2C3_Init(&hbus_i2c3, I2C_GetTiming(HAL_RCC_GetPCLK2Freq(), BUS_I2C3_FREQUENCY)) != HAL_OK)
            {
                ret = BSP_ERROR_BUS_FAILURE;
            }
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
        }
#endif /* (USE_HAL_I2C_REGISTER_CALLBACKS == 1) */
    }
}

return ret;
}

/**
 * @brief  DeInitializes I2C HAL.
 * @retval BSP status
 */
int32_t BSP_I2C3_DeInit(void)
{
    int32_t ret = BSP_ERROR_NONE;

    I2c1InitCounter--;

    if (I2c1InitCounter == 0U)
    {
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 0)
        I2C3_MspDeInit(&hbus_i2c3);
#endif /* (USE_HAL_I2C_REGISTER_CALLBACKS == 0) */

        /* Init the I2C */
        if (HAL_I2C_DeInit(&hbus_i2c3) != HAL_OK)
        {
            ret = BSP_ERROR_BUS_FAILURE;
        }
    }

    return ret;
}

/**
 * @brief  MX I2C3 initialization.
 * @param  hi2c I2C handle
 * @param  timing I2C timing
 * @retval HAL status
 */
__weak HAL_StatusTypeDef MX_I2C3_Init(I2C_HandleTypeDef* hi2c, uint32_t timing)
{
    HAL_StatusTypeDef status = HAL_OK;

    hi2c->Init.Timing           = timing;
    hi2c->Init.OwnAddress1      = 0;
    hi2c->Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
    hi2c->Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
    hi2c->Init.OwnAddress2      = 0;
    hi2c->Init.OwnAddress2Masks = I2C_OA2_NOMASK;
    hi2c->Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
    hi2c->Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;

    if (HAL_I2C_Init(hi2c) != HAL_OK)
    {
        status = HAL_ERROR;
    }
    else
    {
        uint32_t analog_filter;

        analog_filter = I2C_ANALOGFILTER_ENABLE;
        if (HAL_I2CEx_ConfigAnalogFilter(hi2c, analog_filter) != HAL_OK)
        {
            status = HAL_ERROR;
        }
        else
        {
            if (HAL_I2CEx_ConfigDigitalFilter(hi2c, I2C_DIGITAL_FILTER_COEF) != HAL_OK)
            {
                status = HAL_ERROR;
            }
        }
    }

    return status;
}

/**
 * @brief  Write a 8bit value in a register of the device through BUS.
 * @param  DevAddr Device address on Bus.
 * @param  Reg    The target register address to write
 * @param  pData  The target register value to be written
 * @param  Length buffer size to be written
 * @retval BSP status
 */
int32_t BSP_I2C3_WriteReg(uint16_t DevAddr, uint16_t Reg, uint8_t* pData, uint16_t Length)
{
    int32_t ret;
#if defined(BSP_USE_CMSIS_OS)
    /* Get semaphore to prevent multiple I2C access */
    osSemaphoreWait(BspI2cSemaphore, osWaitForever);
#endif /* BSP_USE_CMSIS_OS */
    if (I2C3_WriteReg(DevAddr, Reg, I2C_MEMADD_SIZE_8BIT, pData, Length) == 0)
    {
        ret = BSP_ERROR_NONE;
    }
    else
    {
        if (HAL_I2C_GetError(&hbus_i2c3) == HAL_I2C_ERROR_AF)
        {
            ret = BSP_ERROR_BUS_ACKNOWLEDGE_FAILURE;
        }
        else
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
    }
#if defined(BSP_USE_CMSIS_OS)
    /* Release semaphore to prevent multiple I2C access */
    osSemaphoreRelease(BspI2cSemaphore);
#endif /* BSP_USE_CMSIS_OS */
    return ret;
}

/**
 * @brief  Read a 8bit register of the device through BUS
 * @param  DevAddr Device address on BUS
 * @param  Reg     The target register address to read
 * @param  pData   Pointer to data buffer
 * @param  Length  Length of the data
 * @retval BSP status
 */
int32_t BSP_I2C3_ReadReg(uint16_t DevAddr, uint16_t Reg, uint8_t* pData, uint16_t Length)
{
    int32_t ret;
#if defined(BSP_USE_CMSIS_OS)
    /* Get semaphore to prevent multiple I2C access */
    osSemaphoreWait(BspI2cSemaphore, osWaitForever);
#endif /* BSP_USE_CMSIS_OS */
    if (I2C3_ReadReg(DevAddr, Reg, I2C_MEMADD_SIZE_8BIT, pData, Length) == 0)
    {
        ret = BSP_ERROR_NONE;
    }
    else
    {
        if (HAL_I2C_GetError(&hbus_i2c3) == HAL_I2C_ERROR_AF)
        {
            ret = BSP_ERROR_BUS_ACKNOWLEDGE_FAILURE;
        }
        else
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
    }
#if defined(BSP_USE_CMSIS_OS)
    /* Release semaphore to prevent multiple I2C access */
    osSemaphoreRelease(BspI2cSemaphore);
#endif /* BSP_USE_CMSIS_OS */
    return ret;
}

/**
 * @brief  Write a 16bit value in a register of the device through BUS.
 * @param  DevAddr Device address on Bus.
 * @param  Reg    The target register address to write
 * @param  pData  The target register value to be written
 * @param  Length buffer size to be written
 * @retval BSP status
 */
int32_t BSP_I2C3_WriteReg16(uint16_t DevAddr, uint16_t Reg, uint8_t* pData, uint16_t Length)
{
    int32_t ret;
#if defined(BSP_USE_CMSIS_OS)
    /* Get semaphore to prevent multiple I2C access */
    osSemaphoreWait(BspI2cSemaphore, osWaitForever);
#endif /* BSP_USE_CMSIS_OS */
    if (I2C3_WriteReg(DevAddr, Reg, I2C_MEMADD_SIZE_16BIT, pData, Length) == 0)
    {
        ret = BSP_ERROR_NONE;
    }
    else
    {
        if (HAL_I2C_GetError(&hbus_i2c3) == HAL_I2C_ERROR_AF)
        {
            ret = BSP_ERROR_BUS_ACKNOWLEDGE_FAILURE;
        }
        else
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
    }
#if defined(BSP_USE_CMSIS_OS)
    /* Release semaphore to prevent multiple I2C access */
    osSemaphoreRelease(BspI2cSemaphore);
#endif /* BSP_USE_CMSIS_OS */
    return ret;
}

/**
 * @brief  Read a 16bit register of the device through BUS
 * @param  DevAddr Device address on BUS
 * @param  Reg     The target register address to read
 * @param  pData   Pointer to data buffer
 * @param  Length  Length of the data
 * @retval BSP status
 */
int32_t BSP_I2C3_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t* pData, uint16_t Length)
{
    int32_t ret;
#if defined(BSP_USE_CMSIS_OS)
    /* Get semaphore to prevent multiple I2C access */
    osSemaphoreWait(BspI2cSemaphore, osWaitForever);
#endif /* BSP_USE_CMSIS_OS */
    if (I2C3_ReadReg(DevAddr, Reg, I2C_MEMADD_SIZE_16BIT, pData, Length) == 0)
    {
        ret = BSP_ERROR_NONE;
    }
    else
    {
        if (HAL_I2C_GetError(&hbus_i2c3) == HAL_I2C_ERROR_AF)
        {
            ret = BSP_ERROR_BUS_ACKNOWLEDGE_FAILURE;
        }
        else
        {
            ret = BSP_ERROR_PERIPH_FAILURE;
        }
    }
#if defined(BSP_USE_CMSIS_OS)
    /* Release semaphore to prevent multiple I2C access */
    osSemaphoreRelease(BspI2cSemaphore);
#endif /* BSP_USE_CMSIS_OS */
    return ret;
}

/**
 * @brief  Checks if target device is ready for communication.
 * @note   This function is used with Memory devices
 * @param  DevAddr  Target device address
 * @param  Trials      Number of trials
 * @retval BSP status
 */
int32_t BSP_I2C3_IsReady(uint16_t DevAddr, uint32_t Trials)
{
    int32_t ret = BSP_ERROR_NONE;
#if defined(BSP_USE_CMSIS_OS)
    /* Get semaphore to prevent multiple I2C access */
    osSemaphoreWait(BspI2cSemaphore, osWaitForever);
#endif /* BSP_USE_CMSIS_OS */
    if (HAL_I2C_IsDeviceReady(&hbus_i2c3, DevAddr, Trials, 1000) != HAL_OK)
    {
        ret = BSP_ERROR_BUSY;
    }
#if defined(BSP_USE_CMSIS_OS)
    /* Release semaphore to prevent multiple I2C access */
    osSemaphoreRelease(BspI2cSemaphore);
#endif /* BSP_USE_CMSIS_OS */
    return ret;
}

/**
 * @brief  Delay function
 * @retval Tick value
 */
int32_t BSP_GetTick(void)
{
    return (int32_t) HAL_GetTick();
}

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
/**
 * @brief Register Default I2C3 Bus Msp Callbacks
 * @retval BSP status
 */
int32_t BSP_I2C3_RegisterDefaultMspCallbacks(void)
{
    int32_t ret = BSP_ERROR_NONE;
    #if defined(BSP_USE_CMSIS_OS)
    /* Get semaphore to prevent multiple I2C access */
    osSemaphoreWait(BspI2cSemaphore, osWaitForever);
    #endif /* BSP_USE_CMSIS_OS */
    __HAL_I2C_RESET_HANDLE_STATE(&hbus_i2c3);

