yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_bus.c
    /* Register default MspInit/MspDeInit Callback */
    if (HAL_I2C_RegisterCallback(&hbus_i2c3, HAL_I2C_MSPINIT_CB_ID, I2C3_MspInit) != HAL_OK)
    {
        ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_I2C_RegisterCallback(&hbus_i2c3, HAL_I2C_MSPDEINIT_CB_ID, I2C3_MspDeInit) != HAL_OK)
    {
        ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
        IsI2c1MspCbValid = 1U;
    }
    #if defined(BSP_USE_CMSIS_OS)
    /* Release semaphore to prevent multiple I2C access */
    osSemaphoreRelease(BspI2cSemaphore);
    #endif /* BSP_USE_CMSIS_OS */
    /* BSP status */
    return ret;
}

/**
 * @brief Register I2C3 Bus Msp Callback registering
 * @param Callbacks     pointer to I2C3 MspInit/MspDeInit callback functions
 * @retval BSP status
 */
int32_t BSP_I2C3_RegisterMspCallbacks(BSP_I2C_Cb_t* Callback)
{
    int32_t ret = BSP_ERROR_NONE;
    #if defined(BSP_USE_CMSIS_OS)
    /* Get semaphore to prevent multiple I2C access */
    osSemaphoreWait(BspI2cSemaphore, osWaitForever);
    #endif /* BSP_USE_CMSIS_OS */
    __HAL_I2C_RESET_HANDLE_STATE(&hbus_i2c3);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_I2C_RegisterCallback(&hbus_i2c3, HAL_I2C_MSPINIT_CB_ID, Callback->pMspI2cInitCb) != HAL_OK)
    {
        ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_I2C_RegisterCallback(&hbus_i2c3, HAL_I2C_MSPDEINIT_CB_ID, Callback->pMspI2cDeInitCb) != HAL_OK)
    {
        ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
        IsI2c1MspCbValid = 1U;
    }
    #if defined(BSP_USE_CMSIS_OS)
    /* Release semaphore to prevent multiple I2C access */
    osSemaphoreRelease(BspI2cSemaphore);
    #endif /* BSP_USE_CMSIS_OS */
    /* BSP status */
    return ret;
}
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
/**
 * @}
 */

/** @defgroup STM32H7RSXX_NUCLEO_BUS_Private_Functions Private Functions
 * @{
 */
/**
 * @brief  Compute I2C timing according current I2C clock source and required I2C clock.
 * @param  clock_src_freq I2C clock source in Hz.
 * @param  i2c_freq Required I2C clock in Hz.
 * @retval I2C timing or 0 in case of error.
 */
static uint32_t I2C_GetTiming(uint32_t clock_src_freq, uint32_t i2c_freq)
{
    uint32_t ret = 0;
    uint32_t speed;
    uint32_t idx;

    if ((clock_src_freq != 0U) && (i2c_freq != 0U))
    {
        for (speed = 0; speed <= (uint32_t) I2C_SPEED_FREQ_FAST_PLUS; speed++)
        {
            if ((i2c_freq >= I2C_Charac[speed].freq_min) &&
                (i2c_freq <= I2C_Charac[speed].freq_max))
            {
                I2C_Compute_PRESC_SCLDEL_SDADEL(clock_src_freq, speed);
                idx = I2C_Compute_SCLL_SCLH(clock_src_freq, speed);

                if (idx < I2C_VALID_TIMING_NBR)
                {
                    ret = ((I2c_valid_timing[idx].presc & 0x0FU) << 28) |
                          ((I2c_valid_timing[idx].tscldel & 0x0FU) << 20) |
                          ((I2c_valid_timing[idx].tsdadel & 0x0FU) << 16) |
                          ((I2c_valid_timing[idx].sclh & 0xFFU) << 8) |
                          ((I2c_valid_timing[idx].scll & 0xFFU) << 0);
                }
                break;
            }
        }
    }

    return ret;
}

/**
 * @brief  Compute PRESC, SCLDEL and SDADEL.
 * @param  clock_src_freq I2C source clock in HZ.
 * @param  I2C_speed I2C frequency (index).
 * @retval None.
 */
static void I2C_Compute_PRESC_SCLDEL_SDADEL(uint32_t clock_src_freq, uint32_t I2C_speed)
{
    uint32_t prev_presc = I2C_PRESC_MAX;
    uint32_t ti2cclk;
    int32_t tsdadel_min;
    int32_t tsdadel_max;
    int32_t tscldel_min;
    uint32_t presc;
    uint32_t scldel;
    uint32_t sdadel;
    uint32_t tafdel_min;
    uint32_t tafdel_max;

    ti2cclk = (SEC2NSEC + (clock_src_freq / 2U)) / clock_src_freq;

    tafdel_min = I2C_ANALOG_FILTER_DELAY_MIN;
    tafdel_max = I2C_ANALOG_FILTER_DELAY_MAX;

    /*   tDNF = DNF x tI2CCLK */
    /*   tPRESC = (PRESC+1) x tI2CCLK */
    /*   SDADEL >= {tf +tHD;DAT(min) - tAF(min) - tDNF - [3 x tI2CCLK]} / {tPRESC} */
    /*   SDADEL <= {tVD;DAT(max) - tr - tAF(max) - tDNF- [4 x tI2CCLK]} / {tPRESC} */

    tsdadel_min = (int32_t) I2C_Charac[I2C_speed].tfall + (int32_t) I2C_Charac[I2C_speed].hddat_min -
                  (int32_t) tafdel_min - (int32_t) (((int32_t) I2C_Charac[I2C_speed].dnf + 3) * (int32_t) ti2cclk);

    tsdadel_max = (int32_t) I2C_Charac[I2C_speed].vddat_max - (int32_t) I2C_Charac[I2C_speed].trise -
                  (int32_t) tafdel_max - (int32_t) (((int32_t) I2C_Charac[I2C_speed].dnf + 4) * (int32_t) ti2cclk);

    /* {[tr+ tSU;DAT(min)] / [tPRESC]} - 1 <= SCLDEL */
    tscldel_min = (int32_t) I2C_Charac[I2C_speed].trise + (int32_t) I2C_Charac[I2C_speed].sudat_min;

    if (tsdadel_min <= 0)
    {
        tsdadel_min = 0;
    }

    if (tsdadel_max <= 0)
    {
        tsdadel_max = 0;
    }

    for (presc = 0; presc < I2C_PRESC_MAX; presc++)
    {
        for (scldel = 0; scldel < I2C_SCLDEL_MAX; scldel++)
        {
            /* TSCLDEL = (SCLDEL+1) * (PRESC+1) * TI2CCLK */
            uint32_t tscldel = (scldel + 1U) * (presc + 1U) * ti2cclk;

            if (tscldel >= (uint32_t) tscldel_min)
            {
                for (sdadel = 0; sdadel < I2C_SDADEL_MAX; sdadel++)
                {
                    /* TSDADEL = SDADEL * (PRESC+1) * TI2CCLK */
                    uint32_t tsdadel = (sdadel * (presc + 1U)) * ti2cclk;

                    if ((tsdadel >= (uint32_t) tsdadel_min) && (tsdadel <= (uint32_t) tsdadel_max))
                    {
                        if (presc != prev_presc)
                        {
                            I2c_valid_timing[I2c_valid_timing_nbr].presc   = presc;
                            I2c_valid_timing[I2c_valid_timing_nbr].tscldel = scldel;
                            I2c_valid_timing[I2c_valid_timing_nbr].tsdadel = sdadel;
                            prev_presc                                     = presc;
                            I2c_valid_timing_nbr++;

                            if (I2c_valid_timing_nbr >= I2C_VALID_TIMING_NBR)
                            {
                                return;
                            }
                        }
                    }
                }
            }
        }
    }
}

/**
 * @brief  Calculate SCLL and SCLH and find best configuration.
 * @param  clock_src_freq I2C source clock in HZ.
 * @param  I2C_speed I2C frequency (index).
 * @retval config index (0 to I2C_VALID_TIMING_NBR], 0xFFFFFFFF for no valid config.
 */
static uint32_t I2C_Compute_SCLL_SCLH(uint32_t clock_src_freq, uint32_t I2C_speed)
{
    uint32_t ret = 0xFFFFFFFFU;
    uint32_t ti2cclk;
    uint32_t ti2cspeed;
    uint32_t prev_error;
    uint32_t dnf_delay;
    uint32_t clk_min;
    uint32_t clk_max;
    uint32_t scll;
    uint32_t sclh;
    uint32_t tafdel_min;

    ti2cclk   = (SEC2NSEC + (clock_src_freq / 2U)) / clock_src_freq;
    ti2cspeed = (SEC2NSEC + (I2C_Charac[I2C_speed].freq / 2U)) / I2C_Charac[I2C_speed].freq;

