yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Appli/Core/Src/stm32h7rsxx_mybrd_bus.c
    tafdel_min = I2C_ANALOG_FILTER_DELAY_MIN;

    /* tDNF = DNF x tI2CCLK */
    dnf_delay = I2C_Charac[I2C_speed].dnf * ti2cclk;

    clk_max = SEC2NSEC / I2C_Charac[I2C_speed].freq_min;
    clk_min = SEC2NSEC / I2C_Charac[I2C_speed].freq_max;

    prev_error = ti2cspeed;

    for (uint32_t count = 0; count < I2c_valid_timing_nbr; count++)
    {
        /* tPRESC = (PRESC+1) x tI2CCLK*/
        uint32_t tpresc = (I2c_valid_timing[count].presc + 1U) * ti2cclk;

        for (scll = 0; scll < I2C_SCLL_MAX; scll++)
        {
            /* tLOW(min) <= tAF(min) + tDNF + 2 x tI2CCLK + [(SCLL+1) x tPRESC ] */
            uint32_t tscl_l = tafdel_min + dnf_delay + (2U * ti2cclk) + ((scll + 1U) * tpresc);

            /* The I2CCLK period tI2CCLK must respect the following conditions:
            tI2CCLK < (tLOW - tfilters) / 4 and tI2CCLK < tHIGH */
            if ((tscl_l > I2C_Charac[I2C_speed].lscl_min) && (ti2cclk < ((tscl_l - tafdel_min - dnf_delay) / 4U)))
            {
                for (sclh = 0; sclh < I2C_SCLH_MAX; sclh++)
                {
                    /* tHIGH(min) <= tAF(min) + tDNF + 2 x tI2CCLK + [(SCLH+1) x tPRESC] */
                    uint32_t tscl_h = tafdel_min + dnf_delay + (2U * ti2cclk) + ((sclh + 1U) * tpresc);

                    /* tSCL = tf + tLOW + tr + tHIGH */
                    uint32_t tscl = tscl_l + tscl_h + I2C_Charac[I2C_speed].trise + I2C_Charac[I2C_speed].tfall;

                    if ((tscl >= clk_min) && (tscl <= clk_max) && (tscl_h >= I2C_Charac[I2C_speed].hscl_min) && (ti2cclk < tscl_h))
                    {
                        int32_t error = (int32_t) tscl - (int32_t) ti2cspeed;

                        if (error < 0)
                        {
                            error = -error;
                        }

                        /* look for the timings with the lowest clock error */
                        if ((uint32_t) error < prev_error)
                        {
                            prev_error                   = (uint32_t) error;
                            I2c_valid_timing[count].scll = scll;
                            I2c_valid_timing[count].sclh = sclh;
                            ret                          = count;
                        }
                    }
                }
            }
        }
    }

    return ret;
}

/**
 * @brief  Initializes I2C MSP.
 * @param  phi2c  I2C handler
 * @retval None
 */
static void I2C3_MspInit(I2C_HandleTypeDef* phi2c)
{
    GPIO_InitTypeDef gpio_init_structure;

    /* Prevent unused argument(s) compilation warning */
    UNUSED(phi2c);

    /*** Configure the GPIOs ***/
    /* Enable SCL GPIO clock */
    BUS_I2C3_SCL_GPIO_CLK_ENABLE();
    /* Enable SDA GPIO clock */
    BUS_I2C3_SDA_GPIO_CLK_ENABLE();

    /* Configure I2C Tx as alternate function */
    gpio_init_structure.Pin       = BUS_I2C3_SCL_PIN;
    gpio_init_structure.Mode      = GPIO_MODE_AF_OD;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;
    gpio_init_structure.Alternate = BUS_I2C3_SCL_AF;
    HAL_GPIO_Init(BUS_I2C3_SCL_GPIO_PORT, &gpio_init_structure);

    /* Configure I2C Rx as alternate function */
    gpio_init_structure.Pin       = BUS_I2C3_SDA_PIN;
    gpio_init_structure.Alternate = BUS_I2C3_SDA_AF;
    HAL_GPIO_Init(BUS_I2C3_SDA_GPIO_PORT, &gpio_init_structure);

    /*** Configure the I2C peripheral ***/
    /* Enable I2C clock */
    BUS_I2C3_CLK_ENABLE();

    /* Force the I2C peripheral clock reset */
    BUS_I2C3_FORCE_RESET();

    /* Release the I2C peripheral clock reset */
    BUS_I2C3_RELEASE_RESET();
}

/**
 * @brief  DeInitializes I2C MSP.
 * @param  phi2c  I2C handler
 * @retval None
 */
static void I2C3_MspDeInit(I2C_HandleTypeDef* phi2c)
{
    GPIO_InitTypeDef gpio_init_structure;

    /* Prevent unused argument(s) compilation warning */
    UNUSED(phi2c);

    /* Configure I2C Tx, Rx as alternate function */
    gpio_init_structure.Pin = BUS_I2C3_SCL_PIN;
    HAL_GPIO_DeInit(BUS_I2C3_SCL_GPIO_PORT, gpio_init_structure.Pin);
    gpio_init_structure.Pin = BUS_I2C3_SDA_PIN;
    HAL_GPIO_DeInit(BUS_I2C3_SDA_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable I2C clock */
    BUS_I2C3_CLK_DISABLE();
}

/**
 * @brief  Write a value in a register of the device through BUS.
 * @param  DevAddr    Device address on Bus.
 * @param  MemAddSize Size of internal memory address
 * @param  Reg        The target register address to write
 * @param  pData      The target register value to be written
 * @param  Length     data length in bytes
 * @retval BSP status
 */
static int32_t I2C3_WriteReg(uint16_t DevAddr, uint16_t Reg, uint16_t MemAddSize, uint8_t* pData, uint16_t Length)
{
    if (HAL_I2C_Mem_Write(&hbus_i2c3, DevAddr, Reg, MemAddSize, pData, Length, 1000) == HAL_OK)
    {
        return BSP_ERROR_NONE;
    }

    return BSP_ERROR_BUS_FAILURE;
}

/**
 * @brief  Read a register of the device through BUS
 * @param  DevAddr    Device address on BUS
 * @param  MemAddSize Size of internal memory address
 * @param  Reg        The target register address to read
 * @param  pData      The target register value to be read
 * @param  Length     data length in bytes
 * @retval BSP status
 */
static int32_t I2C3_ReadReg(uint16_t DevAddr, uint16_t Reg, uint16_t MemAddSize, uint8_t* pData, uint16_t Length)
{
    if (HAL_I2C_Mem_Read(&hbus_i2c3, DevAddr, Reg, MemAddSize, pData, Length, 1000) == HAL_OK)
    {
        return BSP_ERROR_NONE;
    }

    return BSP_ERROR_BUS_FAILURE;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
